Revit 2024 API
BalusterInfo.BalusterFamilyId Property
 The id of the family used for the baluster or post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ElementId BalusterFamilyId { get; set; }
Visual Basic
Public Property BalusterFamilyId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BalusterFamilyId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The balusterFamilyId doesn't refer to a valid baluster family.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace